# 再见字符串
data1 = '鸡你 实在太美哦baby'
data2 = "鸡你 实在太美哦baby"
data3 = """
鸡你
实在太美
哦baby
"""
print(id(data1))
data1 = data1.replace('鸡','只因')
print(id(data1))
index = data1.find('baby')
print(data1[9:])
print(index)
print(data1.split(' '))

# 字符串可以做加法和乘法
data = '你'+'干'+'嘛'
data += data1
data = '鸡'*1000
print(data)


# 格式化字符串的三种方式 本质：填空
# 1.占位符式
# %d 整数
# %f 小数
# %s 字符串
name = '张先生'
jishi = 888
data = '您好，尊贵的%s，您点的%d号技师马上就到，请稍等片刻' % (name,jishi)
print(data)

# 2.format式
data = '您好，尊贵的{}，您点的{}号技师马上就到，请稍等片刻'.format(name,jishi)
print(data)

# 3.f-string式
data = f'您好，尊贵的{name}，您点的{jishi}号技师马上就到，请稍等片刻'
print(data)








# 1*1=1
# 1*2=2 2*2=4
# 1*3=3 2*3=6 3*3=9
# 1*4=4 2*4=8 3*4=12 4*4=16
# 1*5=5 2*5=10 3*5=15 4*5=20 5*5=25
# 1*6=6 2*6=12 3*6=18 4*6=24 5*6=30 6*6=36
# 1*7=7 2*7=14 3*7=21 4*7=28 5*7=35 6*7=42 7*7=49
# 1*8=8 2*8=16 3*8=24 4*8=32 5*8=40 6*8=48 7*8=56 8*8=64
# 1*9=9 2*9=18 3*9=27 4*9=36 5*9=45 6*9=54 7*9=63 8*9=72 9*9=81
