# 集合类型(set)是一种无序且不重复的数据类型
# 语法：以的单个元素的形式在大括号中存储
n = {1,2,3,4,5,6,7,8,9,11,11,1}
print(n,type(n))
dr = {"a":1,"b":2,"c":3,"d":4,"e":5}
print(dr)
de = {'a','b','c','d','e','f','g','h'}
print(de)
# 当集合类型中的类型是数字类型一般不会被打乱
# 当集合中是字符串就会被打乱
# 集合里面不能放列表和元组和字典
# 集合运算：并交叉补
# 并集：将两个集合中的元素都放到一个集合中
# 交集:将两个集合共有的元素放到一个集合中
# 差集：两个集合中独有的元素放到一个集合中
# 补集：两个元素中独有的元素放到一个集合中
# 1向集合中添加元素
s = {"dr","ed","d"}
s.add("ppp")
print(s)
# 2向集合中删除元素
s.remove("ppp")
print(s)
# 3集合并集
set_a ={1,2,3,4,5,6,7}
set_b = {4,5,6,7,8,9}
set_a.update(set_b)
print(set_a)
# 4交集
print(set_a.intersection(set_b))
# 5差集
print(set_a.difference(set_b))
